backend/controllers/BannerController.php

    public function actionEdit()
    {
        $id = intval(Yii::$app->request->get('id'));
        $model = BannerModel::findOne($id);
        $info = $model::find()->where(['id' => $id])->one();
---
SELECT * FROM `banner` WHERE `id`=33

    public function actionType()
    {
        $models = new OptionsModel();
        $info = $models::find()->where(['type' => 'bannertype'])->asArray()->one();
---
SELECT * FROM `options` WHERE `type`='bannertype'