backend/controllers/IndexController.php

SELECT COUNT(*) FROM `log`
SELECT * FROM `log` ORDER BY `id` DESC LIMIT 10
---
    public function actionWelcome()
    {
        //登录记录
        $query = Log::find();
        $count = $query->count();
        $pages = new Pagination(['totalCount' => $count,'pageSize' => '10']);
        $log = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->orderBy('id desc')
            ->all();