backend/controllers/MembersController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Members::find(),
        ]);
        $model = new Members();
        $data = $model->find();
        //with wxpayrecord
        if($_POST){
            $keys = $_POST['search'];
            $type = 'feeuser';
            $pages = new Pagination(['totalCount' =>1, 'pageSize' => '20']);
            $list = $data->asArray()
                ->with([ 'wxpayrecord' => function($query) use($type){
                    $query->andWhere(['=','pay_type',$type])->andWhere('status=1')->orderBy('created DESC');
                },])
                ->where(['like','nickname',$keys])->offset($pages->offset)->limit($pages->limit)->all();
        }else{
            $type = 'feeuser';
            $pages = new Pagination(['totalCount' =>$data->count(), 'pageSize' => '20']);
            $list = $data->asArray()
                ->with([ 'wxpayrecord' => function($query) use($type){
                    $query->andWhere(['=','pay_type',$type])->andWhere('status=1')->orderBy('created DESC');
                },])
                ->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT * FROM `wxpayrecord` WHERE (`pay_type` = 'feeuser') AND (status=1) AND (`mid` IN ('47', '71', '72', '73', '82', '83', '84', '85', '86', '87')) ORDER BY `created` DESC