backend/controllers/OptionController.php

    public function actionWechatSite()
    {
        $model = new OptionsModel();
        $type = 'wechat';
        $find = OptionsModel::find()->where(['type' =>$type])->one();
        $info = json_decode($find['value'], true);


        //获取自定义字段增加
        $data = OptionModel::find()->asArray()->where(['name' =>'OptionsModel'])->one();
---
SELECT * FROM `options` WHERE `type`='wechat'
SELECT * FROM `models` WHERE `name`='OptionsModel'