backend/controllers/SiteController.php

    public function actionIndex()
    {
        $user_id=Yii::$app->user->identity->getId();
        $user_info = Yii::$app->authManager->getRolesByUser($user_id);
        $menu = new Menu();
        $menu = $menu->getLeftMenuList();
        $data = User::find()->where(['id' => $user_id])->one();
---
SELECT * FROM `user` WHERE `id`=1