backend/controllers/UserController.php

    public function actionList()
    {
        $username = Yii::$app->user->identity->username;
        if (Yii::$app->request->post()) {
            //搜索
            if($_POST['username']!=''){
                $username = $_POST['username'];
                $data = User::find()->where(['username'=>$username]);
            }else{
                $data = User::find();
            }

            $pages = new Pagination(['totalCount' =>$data->count(), 'pageSize' => '20']);
            $user = $data->joinWith('usergroup')->offset($pages->offset)->limit($pages->limit)->all();
            return $this->render('list',[
                'user'=>$user,
                'pages' => $pages
            ]);
        }


        $data = User::find();
        $pages = new Pagination(['totalCount' =>$data->count(), 'pageSize' => '20']);
        $user = $data->joinWith('usergroup')->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `user`
SELECT `user`.* FROM `user` LEFT JOIN `auth_assignment` ON `user`.`id` = `auth_assignment`.`user_id` LIMIT 20

    public function actionUpdate(){
        $item_name = Yii::$app->request->get('item_name');
        $id = Yii::$app->request->get('id');
        $model = User::find()->joinWith('usergroup')->where(['id' => $id])->one();
---
SELECT `user`.* FROM `user` LEFT JOIN `auth_assignment` ON `user`.`id` = `auth_assignment`.`user_id` WHERE `id`='1'

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `user` WHERE `id`='1'