common/tools/htmls.php

    public static function site()
    {
        $info = OptionsModel::find()->where(['type'=>'website'])->asArray()->one();
---
SELECT * FROM `options` WHERE `type`='website'

    public static function BannerType($name)
    {
            $info = OptionsModel::find()->where(['type' => 'bannertype'])->one();
---
SELECT * FROM `options` WHERE `type`='bannertype'