common/models/LoginForm.php

    public function loginLog(){
        $userIP = Yii::$app->request->userIP;
        //$data = $this->getIPLoc_sina($userIP);
        $data = '';
        Yii::$app->db->createCommand()->insert(
            'log', [
            'username' => $this->username,
            'create_time' => time(),
            'ip'=>$userIP,
            'data'=>$data,
        ])->execute();
---
INSERT INTO `log` (`username`, `create_time`, `ip`, `data`) VALUES ('admin', '1506588723', '123.114.94.127', '')