backend/models/adds/banner/BannerModel.php

    public function create()
    {

        //事务
        $transaction = Yii::$app->db->beginTransaction();
        try{
            $this->setAttributes($this->attributes);
            if(!$this->save()){
---
INSERT INTO `banner` (`type`, `name`, `link`, `des`, `logo`, `listorder`, `value`) VALUES ('hdp', 'er', '', '', '/attachment/image/20170919/1505807830178555.jpg', 0, NULL)

    public function getAllCats()
    {

        //以数组形式进行输出
        $res = OptionsModel::find()->where(['type'=>'bannertype'])->asArray()->one();
---
SELECT * FROM `options` WHERE `type`='bannertype'